apache/nuttx/arch/risc-v/src/bl808/bl808_serial.c
  .recv =
    {
      .size   = CONFIG_UART1_RXBUFSIZE,
      .buffer = g_uart1rxbuffer,
    },
  .xmit =
    {
      .size   = CONFIG_UART1_TXBUFSIZE,
      .buffer = g_uart1txbuffer,
    },
  .ops  = &g_uart_ops,
  .priv = (void *)&g_uart1priv,
};

static struct bl808_uart_s g_uart2priv =
{
  .irq = BL808_IRQ_UART2,
  .config =
    {
      .idx       = 2,
      .baud      = CONFIG_UART2_BAUD,
      .parity    = CONFIG_UART2_PARITY,
      .data_bits = CONFIG_UART2_BITS,
      .stop_bits = CONFIG_UART2_2STOP,

#ifdef CONFIG_UART2_IFLOWCONTROL
      .iflow_ctl = CONFIG_UART2_IFLOWCONTROL,
#else
      .iflow_ctl = 0,
#endif

#ifdef CONFIG_UART2_OFLOWCONTROL
      .oflow_ctl = CONFIG_UART2_OFLOWCONTROL,
#else
      .oflow_ctl = 0,
#endif
    },
};

static uart_dev_t g_uart2port =
{
#ifdef CONFIG_UART2_SERIAL_CONSOLE
  .isconsole = 1,
#else
  .isconsole = 0,
#endif

  .recv =
    {
      .size   = CONFIG_UART2_RXBUFSIZE,
      .buffer = g_uart2rxbuffer,
    },
  .xmit =
    {
      .size   = CONFIG_UART2_TXBUFSIZE,
      .buffer = g_uart2txbuffer,
    },
  .ops  = &g_uart_ops,
  .priv = (void *)&g_uart2priv,
};

static struct bl808_uart_s g_uart3priv =
{
  .irq = BL808_IRQ_UART3,
  .config =
    {
      .idx       = 3,
      .baud      = CONFIG_UART3_BAUD,
      .parity    = CONFIG_UART3_PARITY,
      .data_bits = CONFIG_UART3_BITS,
      .stop_bits = CONFIG_UART3_2STOP,

#ifdef CONFIG_UART3_IFLOWCONTROL
      .iflow_ctl = CONFIG_UART3_IFLOWCONTROL,
#else
      .iflow_ctl = 0,
#endif

#ifdef CONFIG_UART3_OFLOWCONTROL
      .oflow_ctl = CONFIG_UART3_OFLOWCONTROL,
#else
      .oflow_ctl = 0,
#endif
    },
};

static uart_dev_t g_uart3port =
{
#ifdef CONFIG_UART3_SERIAL_CONSOLE
  .isconsole = 1,
#else
  .isconsole = 0,
#endif

  .recv =
    {
      .size   = CONFIG_UART3_RXBUFSIZE,
      .buffer = g_uart3rxbuffer,
    },
  .xmit =
    {
      .size   = CONFIG_UART3_TXBUFSIZE,
      .buffer = g_uart3txbuffer,
    },
  .ops  = &g_uart_ops,
  .priv = (void *)&g_uart3priv,
};

static struct uart_dev_s *const g_uart_devs[] =
{
  [0] = &g_uart0port,
  [1] = &g_uart1port,
  [2] = &g_uart2port,
  [3] = &g_uart3port
};

/****************************************************************************
 * Name: uart_interrupt
 *
 * Description:
 *   This is the UART interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int __uart_interrupt(int irq, void *context, void *arg)
{
  uart_dev_t *dev = (uart_dev_t *)arg;
  struct bl808_uart_s *priv = dev->priv;
  uint8_t uart_idx = priv->config.idx;
  uint32_t int_status;
  uint32_t int_mask;

  int_status = getreg32(BL808_UART_INT_STS(uart_idx));
  int_mask = getreg32(BL808_UART_INT_MASK(uart_idx));

  /* Length of uart rx data transfer arrived interrupt */

  if ((int_status & UART_INT_STS_URX_END_INT) &&
      !(int_mask & UART_INT_MASK_CR_URX_END_MASK))
    {
      putreg32(UART_INT_CLEAR_CR_URX_END_CLR,
               BL808_UART_INT_CLEAR(uart_idx));

      /* Receive Data ready */

      uart_recvchars(dev);
    }

  /* Tx fifo ready interrupt,auto-cleared when data is pushed */

  if ((int_status & UART_INT_STS_UTX_FIFO_INT) &&
      !(int_mask & UART_INT_MASK_CR_UTX_FIFO_MASK))
    {
      /* Transmit data request interrupt */

      uart_xmitchars(dev);
    }

  /* Rx fifo ready interrupt,auto-cleared when data is popped */

  if ((int_status & UART_INT_STS_URX_FIFO_INT) &&
      !(int_mask & UART_INT_MASK_CR_URX_FIFO_MASK))
    {
      /* Receive Data ready */

      uart_recvchars(dev);
    }

  return OK;
}

/****************************************************************************
 * Name: bl808_uart_configure
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc.
 *
 ****************************************************************************/

static void bl808_uart_configure(const struct uart_config_s *config)
{
  uint8_t uart_idx = config->idx;

  /* UTX_CONFIG */

  uint32_t tmp_val = getreg32(BL808_UART_UTX_CONFIG(uart_idx));

  tmp_val &= ~UART_UTX_CONFIG_CR_BIT_CNT_P_MASK;
  if (config->stop_bits)
    {
      tmp_val |= 3 << UART_UTX_CONFIG_CR_BIT_CNT_P_SHIFT;
    }
  else
    {
      tmp_val |= 1 << UART_UTX_CONFIG_CR_BIT_CNT_P_SHIFT;
    }

  tmp_val &= ~UART_UTX_CONFIG_CR_BIT_CNT_D_MASK;
  tmp_val |= config->data_bits << UART_UTX_CONFIG_CR_BIT_CNT_D_SHIFT;

  switch (config->parity)
    {
    case 0:
      tmp_val &= ~UART_UTX_CONFIG_CR_PRT_EN;
      break;

    case 1:
      tmp_val |= UART_UTX_CONFIG_CR_PRT_EN;
      tmp_val |= UART_UTX_CONFIG_CR_PRT_SEL;
      break;

    case 2:
      tmp_val |= UART_UTX_CONFIG_CR_PRT_EN;
      tmp_val &= ~UART_UTX_CONFIG_CR_PRT_SEL;
      break;
    }

  tmp_val |= UART_UTX_CONFIG_CR_FRM_EN;

  if (config->oflow_ctl)
    {
      tmp_val |= UART_UTX_CONFIG_CR_CTS_EN;
    }
  else
    {
      tmp_val &= ~UART_UTX_CONFIG_CR_CTS_EN;
    }

  tmp_val |= UART_UTX_CONFIG_CR_EN;
  putreg32(tmp_val, BL808_UART_UTX_CONFIG(uart_idx));

  /* URX CONFIG */

  tmp_val = getreg32(BL808_UART_URX_CONFIG(uart_idx));
  tmp_val |= UART_URX_CONFIG_CR_EN;
  putreg32(tmp_val, BL808_UART_URX_CONFIG(uart_idx));

  /* BIT PRD (baud rate) */

  uint16_t div = BL808_UART_CLK / config->baud - 1;
  tmp_val = getreg32(BL808_UART_BIT_PRD(uart_idx));
  tmp_val = div | (div << 16);
  putreg32(tmp_val, BL808_UART_BIT_PRD(uart_idx));

  /* FIFO CONFIG 1 */

  tmp_val = getreg32(BL808_UART_FIFO_CONFIG_1(uart_idx));
  tmp_val |= 1 << UART_FIFO_CONFIG_1_TX_TH_SHIFT;
  putreg32(tmp_val, BL808_UART_FIFO_CONFIG_1(uart_idx));
}

/****************************************************************************
 * Name: bl808_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int bl808_setup(struct uart_dev_s *dev)
{
  struct bl808_uart_s *priv = (struct bl808_uart_s *)dev->priv;

